app/controllers/stocks_controller.rb

  def search
    if params[:stock]
      @stock = Stock.find_by_ticker(params[:stock])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ?  ORDER BY "stocks"."id" ASC LIMIT 1  [["ticker", "goog"]]